// ------------ BURGER ---------------------
import "./modules/burger"

// ------------ SWIPER-SLIDER ---------------------
import "./modules/swiper-slider"

// ------------ VIMEO-VIDEO ---------------------
import "./modules/video"

// ------------- LIGHTBOX -------------------------
import "./modules/lightbox"

// ------------- LAZYLOAD -------------------------
import "./modules/lazyload"

// - ***поставить ширину контейнера в base если все будет норм
// - сделать треугольник svg адаптивным
// - разобраться с z-index
// - ***поуменьшать отступы на маленьких разрешениях
// - наблюдать за изменением разрешения и производить swiper.update()
// - установить PostCSS и autoprefixer
// - ***подумать над таймаутом  modal.classList.add("modal_active");
// - не забивается ли стэк при каждом вызове инит?
// - ***изменить название titleFont
// - убрать лишний класс slide-content у слайдеров и передать стили просто slide
// - настроить quotes слайдеры так, чтобы по верхнему можно было свайпать
// - сделать адаптив до 1920
// - ***в конце разбить стили по отдельным файлам
