// ------------ BURGER ---------------------
import "./modules/burger"

// ------------ SWIPER-SLIDER ---------------------
import "./modules/swiper-slider"

// ------------ VIMEO-VIDEO ---------------------
import "./modules/video"

// ------------- LIGHTBOX -------------------------
import "./modules/lightbox"


// - поставить ширину контейнера в base если все будет норм
// - сделать треугольник svg адаптивным
// - разобраться с z-index
// - поуменьшать отступы на маленьких разрешениях
// - наблюдать за изменением разрешения и производить swiper.update()
