// ------------ BURGER ---------------------
import "./modules/burger"

// ------------ SWIPER-SLIDER ---------------------
import "./modules/swiper-slider"

// ------------ VIMEO-VIDEO ---------------------
import "./modules/video"

// ------------- LIGHTBOX -------------------------
import "./modules/lightbox"

// ------------- LAZYLOAD -------------------------
import "./modules/lazyload"

// ------------- FORM -------------------------
import "./modules/form"

// ------------- SCROLL -------------------------
import "./modules/scroll"


// - установить PostCSS и autoprefixer
// - анимация появления при скролле
// - сделать чтобы при открытии модальных окон полоса прокрутки не дергалась
// - попробовать lazy loading от swiper
// - сделать выбор анимации более удобной (мб регэкспами) (или создавать класс динамически и добавлять к нему кейфрэймс)
// - сделать чтобы при прокрутке вверх если обновили страницу не в начале не анимировалась часть сверху


// МБ:
// // - разобраться с z-index
// // - переписать lightbox
// // - // - зум в галерее
// // - // - сделать адаптив до 1920